098_Мастер_Ра_разработка/src/InformationRegisters/СоответствиеВидаРаботыИПродукции/СоответствиеВидаРаботыИПродукции.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СоответствиеВидаРаботыИПродукции</name>
  <dimensions>
    <name>ВидРабот</name>
    <type>
      <types>EnumRef.ВидыРабот</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидПродукции</name>
    <type>
      <types>EnumRef.ВидыПродукции</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

098_Мастер_Ра_разработка/src/InformationRegisters/СоответствиеПродукцииИСтоимости/СоответствиеПродукцииИСтоимости.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СоответствиеПродукцииИСтоимости</name>
  <dimensions>
    <name>Стоимость</name>
    <type>
      <types>EnumRef.РаботыСтоимости</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидРабот</name>
    <type>
      <types>EnumRef.ВидыРабот</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

098_Мастер_Ра_разработка/src/InformationRegisters/ОтвественныеЛица/ОтвественныеЛица.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОтвественныеЛица</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>ФизическоеЛицо</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Должность</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОтветственноеЛицо</name>
    <type>
      <types>EnumRef.ОтветственныеЛица</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

098_Мастер_Ра_разработка/src/InformationRegisters/БрендыКонтрагентов/БрендыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>БрендыКонтрагентов</name>
  <dimensions>
    <name>Бренд</name>
    <type>
      <types>CatalogRef.Бренды</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

098_Мастер_Ра_разработка/src/Catalogs/Должности/Должности.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Должности</name>
  <predefined>
    <items>
      <name>Дизайнер</name>
      <description>Дизайнер</description>
    </items>
    <items>
      <name>Монтажник</name>
      <description>Монтажник</description>
    </items>
    <items>
      <name>ОператорПечатногоОборудования</name>
      <description>Оператор печатного оборудования</description>
    </items>
    <items>
      <name>ТехникПостпечатнойОбработки</name>
      <description>Техник постпечатной обработки</description>
    </items>
  </predefined>
  <attributes>
    <name>Оклад</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

098_Мастер_Ра_разработка/src/Catalogs/Контрагенты/Контрагенты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Контрагенты</name>
  <attributes>
    <name>Банк</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БезДоговора</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>БИК</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Бренд</name>
    <type>
      <types>CatalogRef.Бренды</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПоследнегоИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ИНН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КорреспондентскийСчет</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КПП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>512</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерРасчетногоСчета</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОГРН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОКПО</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>8</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтвественныйМенеджер</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроцентМенеджера</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтавкаНДС</name>
    <type>
      <types>EnumRef.СтавкиНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусЗаказчик</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусПоставщик</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусПрочий</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Телефон</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФактическийАдрес</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФормаСобственности</name>
    <type>
      <types>CatalogRef.ФормыСобственности</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭлектроннаяПочта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЮридическийАдрес</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЮрФизЛицо</name>
    <type>
      <types>EnumRef.ЮрФизЛицо</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтактныеЛица</name>
    <attributes>
      <name>ФИО</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Должность</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Телефон</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Email</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Бренды</name>
    <attributes>
      <name>Бренд</name>
      <type>
        <types>CatalogRef.Бренды</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТипыВыполняемыхРабот</name>
    <attributes>
      <name>РаботыСубподрядчика</name>
      <type>
        <types>CatalogRef.РаботыСубподрядчика</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Доставка</name>
    <attributes>
      <name>Адрес</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

098_Мастер_Ра_разработка/src/CommonModules/ПолучениеСписков/Module.bsl
// @strict-types


Функция Печатников() Экспорт
		
	спСотрудников = Новый СписокЗначений;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Сотрудники.Ссылка
		|ИЗ
		|	Справочник.Сотрудники КАК Сотрудники
		|ГДЕ
		|	Сотрудники.Должность = &Должность";

	Запрос.УстановитьПараметр("Должность", Справочники.Должности.ОператорПечатногоОборудования);

	Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		спСотрудников.Добавить(ВыборкаДетальныеЗаписи.Ссылка);
	КонецЦикла;	
	
	Возврат спСотрудников;
	
КонецФункции

Функция Техников() Экспорт
		
	спСотрудников = Новый СписокЗначений;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Сотрудники.Ссылка
		|ИЗ
		|	Справочник.Сотрудники КАК Сотрудники
		|ГДЕ
		|	Сотрудники.Должность = &Должность";

	Запрос.УстановитьПараметр("Должность", Справочники.Должности.ТехникПостпечатнойОбработки);

	Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		спСотрудников.Добавить(ВыборкаДетальныеЗаписи.Ссылка);
	КонецЦикла;	
	
	Возврат спСотрудников;
	
КонецФункции

Функция ВидовПродукции(ВидРабот) Экспорт
		
	спПродукции = Новый СписокЗначений;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СоответствиеВидаРаботыИПродукции.ВидПродукции КАК ВидПродукции
		|ИЗ
		|	РегистрСведений.СоответствиеВидаРаботыИПродукции КАК СоответствиеВидаРаботыИПродукции
		|ГДЕ
		|	СоответствиеВидаРаботыИПродукции.ВидРабот = &ВидРабот";

	Запрос.УстановитьПараметр("ВидРабот", ВидРабот);

	Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		спПродукции.Добавить(ВыборкаДетальныеЗаписи.ВидПродукции);
	КонецЦикла;	
	
	Возврат спПродукции;
	
КонецФункции

Функция ВидовСтоимости(ВидРабот) Экспорт
		
	спСтоимости= Новый СписокЗначений;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СоответствиеПродукцииИСтоимости.Стоимость КАК Стоимость
		|ИЗ
		|	РегистрСведений.СоответствиеПродукцииИСтоимости КАК СоответствиеПродукцииИСтоимости
		|ГДЕ
		|	СоответствиеПродукцииИСтоимости.ВидРабот = &ВидРабот";

	Запрос.УстановитьПараметр("ВидРабот", ВидРабот);

	Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		спСтоимости.Добавить(ВыборкаДетальныеЗаписи.Стоимость);
	КонецЦикла;	
	
	Возврат спСтоимости;
	
КонецФункции

Функция ОтвественныхЛиц(Организация,ОтветственноеЛицо,наДату) Экспорт 
	
	Структура = Новый Структура;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОтвественныеЛицаСрезПоследних.ФизическоеЛицо,
		|	ОтвественныеЛицаСрезПоследних.Должность.Наименование КАК Должность
		|ИЗ
		|	РегистрСведений.ОтвественныеЛица.СрезПоследних(
		|			&НаДату,
		|			Организация = &Организация
		|				И ОтветственноеЛицо = &ОтветственноеЛицо) КАК ОтвественныеЛицаСрезПоследних";

	Запрос.УстановитьПараметр("НаДату", НаДату);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ОтветственноеЛицо", ОтветственноеЛицо);

	Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Структура.Вставить("ФизическоеЛицо",ВыборкаДетальныеЗаписи.ФизическоеЛицо);
		Структура.Вставить("Должность",ВыборкаДетальныеЗаписи.Должность);
	КонецЦикла;
	 
	Возврат Структура;
	 
КонецФункции

Функция АдресовДоставкиПоБренду(Бренд) Экспорт
		
	спАдресов = Новый СписокЗначений;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВложенныйЗапрос.Адрес КАК Адрес
		|ИЗ
		|	Справочник.Контрагенты.Бренды КАК КонтрагентыБренды
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			КонтрагентыДоставка.Адрес КАК Адрес,
		|			КонтрагентыДоставка.Ссылка КАК Контрагент
		|		ИЗ
		|			Справочник.Контрагенты.Доставка КАК КонтрагентыДоставка) КАК ВложенныйЗапрос
		|		ПО КонтрагентыБренды.Ссылка = ВложенныйЗапрос.Контрагент
		|ГДЕ
		|	КонтрагентыБренды.Бренд = &Бренд";

	Запрос.УстановитьПараметр("Бренд", Бренд);

	Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		спАдресов.Добавить(ВыборкаДетальныеЗаписи.Адрес);
	КонецЦикла;	
	
	Возврат спАдресов;
	
КонецФункции

Функция АдресовДоставкиПоКонтрагенту(Контрагент) Экспорт
		
	спАдресов = Новый СписокЗначений;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КонтрагентыДоставка.Адрес КАК Адрес
		|ИЗ
		|	Справочник.Контрагенты.Доставка КАК КонтрагентыДоставка
		|ГДЕ
		|	КонтрагентыДоставка.Ссылка = &Контрагент";

	Запрос.УстановитьПараметр("Контрагент", Контрагент);

	Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		спАдресов.Добавить(ВыборкаДетальныеЗаписи.Адрес);
	КонецЦикла;	
	
	Возврат спАдресов;
	
КонецФункции

Функция КонтрагентовПоБренду(Бренд) Экспорт 
	
	СпКонтрагентов = Новый СписокЗначений;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	 "ВЫБРАТЬ
	 |	БрендыКонтрагентов.Контрагент
	 |ИЗ
	 |	РегистрСведений.БрендыКонтрагентов КАК БрендыКонтрагентов
	 |ГДЕ
	 |	БрендыКонтрагентов.Бренд = &Бренд";
	 
	 Запрос.УстановитьПараметр("Бренд",Бренд);
	 
	 Выборка = Запрос.Выполнить().Выбрать();
	 
	 Пока Выборка.Следующий() цикл
		 СпКонтрагентов.Добавить(Выборка.Контрагент);
	 КонецЦикла;	 
	 
	 Возврат СпКонтрагентов;
	 
КонецФункции
